app/views/municipios/index.html.erb

SELECT  `provincia`.* FROM `provincia` WHERE `provincia`.`id` = 1 LIMIT 1
---
        <td><%= municipio.codigo %></td>
        <td><%= Provincium.find(municipio.provincia_id).descricao %></td>