app/views/municipios/show.html.erb

SELECT  `provincia`.* FROM `provincia` WHERE `provincia`.`id` = NULL LIMIT 1
---
  <strong>Provincia:</strong>
  <%= Provincium.find(@municipio.provincia_id).descricao  %>