app/views/entidades/_form.html.erb

SELECT `municipios`.* FROM `municipios`
---

        <%= f.collection_select(:municipio_id, Municipio.all, :id, :descricao, prompt: false) %>

SELECT `bairros`.* FROM `bairros`
---

        <%= f.collection_select(:bairro_id, Bairro.all, :id, :descricao, prompt: false) %>

SELECT `tipo_entidades`.* FROM `tipo_entidades`
---
        <%= f.label :tipoEntidade %>
        <%= f.collection_select(:tipoEntidade, TipoEntidade.all, :id, :descricao, {include_blank: "Selecione"}, prompt: true) %>