app/views/entidades/index.html.erb

SELECT  `tipo_entidades`.* FROM `tipo_entidades` WHERE `tipo_entidades`.`id` = 1 LIMIT 1
---
        <td><%= entidade.nif %></td>
        <td><%= TipoEntidade.find(entidade.tipoEntidade).descricao %></td>