app/views/entidades/show.html.erb

          <strong>Provincia:</strong>
          <%= Provincium.find(@entidade.provincia_id).descricao %>
---
SELECT  `provincia`.* FROM `provincia` WHERE `provincia`.`id` = 1 LIMIT 1

          <strong>Municipio:</strong>
          <%= Municipio.find(@entidade.municipio_id).descricao %>
---
SELECT  `municipios`.* FROM `municipios` WHERE `municipios`.`id` = 1 LIMIT 1

          <strong>Bairro:</strong>
          <%= Bairro.find(@entidade.bairro_id).descricao %>
---
SELECT  `bairros`.* FROM `bairros` WHERE `bairros`.`id` = 1 LIMIT 1

          <strong>Tipoentidade:</strong>
          <%= TipoEntidade.find(@entidade.tipoEntidade).descricao %>
---
SELECT  `tipo_entidades`.* FROM `tipo_entidades` WHERE `tipo_entidades`.`id` = 1 LIMIT 1