app/controllers/bairros_controller.rb

SELECT `bairros`.* FROM `bairros`
---
  def index
    @bairros = Bairro.all

INSERT INTO `bairros` (`descricao`, `codigo`, `municipio_id`, `created_at`, `updated_at`) VALUES ('5 Abril', '5A', 1, '2017-03-28 23:00:27', '2017-03-28 23:00:27')
---
  def create
    @bairro = Bairro.new(bairro_params)

    respond_to do |format|
      if @bairro.save

UPDATE `bairros` SET `codigo` = 'Ab', `updated_at` = '2017-03-29 00:24:26' WHERE `bairros`.`id` = 1
---
  def update
    respond_to do |format|
      if @bairro.update(bairro_params)

DELETE FROM `bairros` WHERE `bairros`.`id` = 2
---
  def destroy
    @bairro.destroy

SELECT  `bairros`.* FROM `bairros` WHERE `bairros`.`id` = 2 LIMIT 1
---
    def set_bairro
      @bairro = Bairro.find(params[:id])