app/controllers/bancos_controller.rb

SELECT `bancos`.* FROM `bancos`
---
  def index
    @bancos = Banco.all

INSERT INTO `bancos` (`CodBanco`, `descricao`, `estado`, `utilizador`, `created_at`, `updated_at`) VALUES ('BPC', 'Banco de Poupanças e Comercio', 1, 1, '2017-04-05 22:07:15', '2017-04-05 22:07:15')
---
  def create
    @banco = Banco.new(banco_params)

    respond_to do |format|
      if @banco.save

SELECT  `bancos`.* FROM `bancos` WHERE `bancos`.`id` = 1 LIMIT 1
---
    def set_banco
      @banco = Banco.find(params[:id])