app/controllers/entidades_controller.rb

SELECT COUNT(*) FROM `entidades`
---
  def index
    @entidades = Entidade.all.order("created_at DESC").paginate(page: params[:page], per_page: 5)

INSERT INTO `entidades` (`nome`, `bi`, `provincia_id`, `municipio_id`, `bairro_id`, `pai`, `mae`, `nif`, `tipoEntidade`, `nacionalidade`, `profissao`, `genero`, `estadoCivil`, `telefone`, `email`, `homePage`, `estado`, `created_at`, `updated_at`, `foto`) VALUES ('Mariano', '983723983LA78', 1, 1, 3, 'Americo', 'Bita', '732687', 1, 'Angolana', 'TI', 'M', 'Casado/a', '9978', 'ariclinis1@gmail.com', 1, 'Activo', '2017-04-11 15:36:11', '2017-04-11 15:36:11', 'Captura_de_ecrã_de_2017-03-24_11-45-54.png')
---
  def create
    @entidade = Entidade.new(entidade_params)

    respond_to do |format|
      if @entidade.save

UPDATE `entidades` SET `estado` = 'Activo', `foto` = '#<ActionDispatch::Http::UploadedFile:0x007f5a941ad1c8>', `updated_at` = '2017-04-05 11:31:52' WHERE `entidades`.`id` = 1
---
  def update
    respond_to do |format|
      if @entidade.update(entidade_params)

SELECT  `tipo_entidades`.* FROM `tipo_entidades` WHERE `tipo_entidades`.`id` = 1 LIMIT 1
---
    def set_entidade
      @entidade = Entidade.find(params[:id])