app/controllers/municipios_controller.rb

SELECT `municipios`.* FROM `municipios`
---
  def index
    @municipios = Municipio.all

INSERT INTO `municipios` (`descricao`, `codigo`, `provincia_id`, `created_at`, `updated_at`) VALUES ('Namibe', 'NB', 1, '2017-03-28 22:58:52', '2017-03-28 22:58:52')
---
  def create
    @municipio = Municipio.new(municipio_params)

    respond_to do |format|
      if @municipio.save

SELECT  `municipios`.* FROM `municipios` WHERE `municipios`.`id` = 1 LIMIT 1
---
    def set_municipio
      @municipio = Municipio.find(params[:id])