app/controllers/operacoes_faturas_controller.rb

SELECT `operacoes_faturas`.* FROM `operacoes_faturas`
---
  def index
    @operacoes_faturas = OperacoesFatura.all

INSERT INTO `operacoes_faturas` (`codigo`, `descricao`, `id_estado`, `id_utilizador`, `created_at`, `updated_at`) VALUES ('Nada', 'Nada', 1, 1, '2017-04-23 00:34:26', '2017-04-23 00:34:26')
---
  def create
    @operacoes_fatura = OperacoesFatura.new(operacoes_fatura_params)

    respond_to do |format|
      if @operacoes_fatura.save

SELECT  `operacoes_faturas`.* FROM `operacoes_faturas` WHERE `operacoes_faturas`.`id` = 1 LIMIT 1
---
    def set_operacoes_fatura
      @operacoes_fatura = OperacoesFatura.find(params[:id])