app/controllers/pagamentos_controller.rb

SELECT  `pagamentos`.* FROM `pagamentos` ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @pagamentos = Pagamento.all.order("created_at DESC").paginate(page: params[:page], per_page: 5)

INSERT INTO `pagamentos` (`codigo`, `formaPagamento`, `banco_id`, `conta_bancaria_id`, `numeroTalao`, `dataPagamento`, `valorTalao`, `valorUtilizado`, `created_at`, `updated_at`) VALUES ('ASc', 'Deposito Bancário', 1, 1, '12', '2017-04-22', 4.0, 13.0, '2017-04-22 11:49:25', '2017-04-22 11:49:25')
---
  def create
    @pagamento = Pagamento.new(pagamento_params)

    respond_to do |format|
      if @pagamento.save

SELECT  `pagamentos`.* FROM `pagamentos` WHERE `pagamentos`.`id` = 1 LIMIT 1
---
    def set_pagamento
      @pagamento = Pagamento.find(params[:id])