app/controllers/tipo_entidades_controller.rb

  def index
    @tipo_entidades = TipoEntidade.all
---
SELECT `tipo_entidades`.* FROM `tipo_entidades`

  def create
    @tipo_entidade = TipoEntidade.new(tipo_entidade_params)

    respond_to do |format|
      if @tipo_entidade.save
---
INSERT INTO `tipo_entidades` (`descricao`, `created_at`, `updated_at`, `codigo`) VALUES ('Cliente Nacional', '2017-03-29 17:33:12', '2017-03-29 17:33:12', '12')

  def update
    respond_to do |format|
      if @tipo_entidade.update(tipo_entidade_params)
---
UPDATE `tipo_entidades` SET `codigo` = 'CN', `updated_at` = '2017-03-29 17:34:00' WHERE `tipo_entidades`.`id` = 2

  def destroy
    @tipo_entidade.destroy
---
DELETE FROM `tipo_entidades` WHERE `tipo_entidades`.`id` = 2

    def set_tipo_entidade
      @tipo_entidade = TipoEntidade.find(params[:id])
---
SELECT  `tipo_entidades`.* FROM `tipo_entidades` WHERE `tipo_entidades`.`id` = 2 LIMIT 1