app/controllers/utilizadors_controller.rb

SELECT `utilizadors`.* FROM `utilizadors`
---
  def index
    @utilizadors = Utilizador.all

INSERT INTO `utilizadors` (`nome`, `nome_login`, `email`, `senha`, `nivel_acesso`, `estado`, `created_at`, `updated_at`) VALUES ('Ariclinis Chimbili', 'Ariclinis', 'Ariclinis1@gmail.com', '12345', 'Admin', 'Activo', '2017-04-07 15:20:50', '2017-04-07 15:20:50')
---
  def create
    @utilizador = Utilizador.new(utilizador_params)

    respond_to do |format|
      if @utilizador.save

SELECT  `utilizadors`.* FROM `utilizadors` WHERE `utilizadors`.`id` = 1 LIMIT 1
---
    def set_utilizador
      @utilizador = Utilizador.find(params[:id])