app/views/pagamentos/_form.html.erb

        <br><br>
        <%= f.collection_select(:banco_id, Banco.all, :id, :descricao, prompt: false) %>
---
SELECT `bancos`.* FROM `bancos`