app/views/bairros/_form.html.erb

        <%= f.label :municipio_id %>
        <%= f.collection_select(:municipio_id, Municipio.all, :id, :descricao, prompt: true) %>
---
SELECT `municipios`.* FROM `municipios`