app/views/bairros/index.html.erb

SELECT  `municipios`.* FROM `municipios` WHERE `municipios`.`id` = 1 LIMIT 1
---
    <td><%= bairro.codigo %></td>
    <td><%= Municipio.find(bairro.municipio_id).descricao  %></td>