app/views/bairros/show.html.erb

				<p>
					<h4><span class="label label-default">Municipio:</span> <%= Municipio.find(@bairro.municipio_id).descricao %></h4>
---
SELECT  `municipios`.* FROM `municipios` WHERE `municipios`.`id` = 1 LIMIT 1